In [ ]:
# apply, map, applymap 함수 

# 1) apply 는 Series 나 Dataframe 의 객체 요소에 적용시킬 수 있음
# 2) map 은 Series에만 적용 
# 3) applymap 은 DataFrame에만 적용

In [21]:
# 1) apply() 사용하기 with DataFame

import pandas as pd
df = pd.DataFrame({ 'A': [1,2,3,4], 
                   'B': [10,20,30,40],
                   'C': [20,40,60,80]
                  }, 
                  index=['Row 1', 'Row 2', 'Row 3', 'Row 4'])

df

       A   B   C
Row 1  1  10  20
Row 2  2  20  40
Row 3  3  30  60
Row 4  4  40  80

In [24]:
def custom_sum(row):
    return row.sum()
# axis =1(열중심) applying the function to each row

df["D"] = df.apply(custom_sum,axis=1)  
df

       A   B   C      D
Row 1  1  10  20   62.0
Row 2  2  20  40  124.0
Row 3  3  30  60  186.0
Row 4  4  40  80  248.0

In [25]:
# axis= 0 (행중심)  applyting the function to each column

df.loc["Row 5"] = df.apply(custom_sum, axis=0)
df

          A      B      C      D
Row 1   1.0   10.0   20.0   62.0
Row 2   2.0   20.0   40.0  124.0
Row 3   3.0   30.0   60.0  186.0
Row 4   4.0   40.0   80.0  248.0
Row 5  10.0  100.0  200.0  620.0

In [27]:
# 2) apply() 사용하기 with Series

def multipl_by2(val):
    return val * 2

df["D"]= df["C"].apply(multipl_by2)
df

          A      B      C      D
Row 1   1.0   10.0   20.0   40.0
Row 2   2.0   20.0   40.0   80.0
Row 3   3.0   30.0   60.0  120.0
Row 4   4.0   40.0   80.0  160.0
Row 5  10.0  100.0  200.0  400.0

In [28]:
# 3) apply() 사용하기 using lambda 
# 위에 썼던 식을 lambda로 적을 수 있다.

import pandas as pd
df = pd.DataFrame({ 'A': [1,2,3,4], 
                   'B': [10,20,30,40],
                   'C': [20,40,60,80]
                  }, 
                  index=['Row 1', 'Row 2', 'Row 3', 'Row 4'])

df

       A   B   C
Row 1  1  10  20
Row 2  2  20  40
Row 3  3  30  60
Row 4  4  40  80

In [29]:
df["D"] = df.apply(lambda x: x.sum(), axis = 1)
df

       A   B   C    D
Row 1  1  10  20   31
Row 2  2  20  40   62
Row 3  3  30  60   93
Row 4  4  40  80  124

In [30]:
df.loc["Row5"] = df.apply(lambda x: x.sum(), axis = 0)
df

        A    B    C    D
Row 1   1   10   20   31
Row 2   2   20   40   62
Row 3   3   30   60   93
Row 4   4   40   80  124
Row5   10  100  200  310

In [31]:
df["D"]= df["C"].apply(lambda x: x*2)
df

        A    B    C    D
Row 1   1   10   20   40
Row 2   2   20   40   80
Row 3   3   30   60  120
Row 4   4   40   80  160
Row5   10  100  200  400

In [2]:
# 1.개별 원소에 함수 Mapping 

import seaborn as sns 
titanic = sns.load_dataset("titanic")
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [7]:
# age, fare 열만 가져와보자 
df = titanic.loc[:,["age","fare"]]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [9]:
# "ten"이라는 새로운 열을 만들어 10의 값을 넣어보기 
df["ten"] = 10 
df.head(10)

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10
5   NaN   8.4583   10
6  54.0  51.8625   10
7   2.0  21.0750   10
8  27.0  11.1333   10
9  14.0  30.0708   10

In [10]:
# 두 가지 함수 만들기 
def add_10(x):
    return x + 10  # 10을 더해주는 함수 

def add_obj(a,b):
    return a+b  # a, b를 더해주는 함수 

print(add_10(10))
print(add_obj(100,100))

20
200

In [12]:
# apply 함수를 이용해 시리즈 객체의 개별원소에 적용시켜보자 

# age 열에 적용시켜보자 
df1 = df["age"].apply(add_10)
print(df1.head(10))

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
5     NaN
6    64.0
7    12.0
8    37.0
9    24.0
Name: age, dtype: float64

In [17]:
df2 = df["age"].apply(add_obj,b=10)
print(df2.head(10))

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
5     NaN
6    64.0
7    12.0
8    37.0
9    24.0
Name: age, dtype: float64

In [20]:
df3 = df["age"].apply(lambda x: add_10(x))
df3.head(10)

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
5     NaN
6    64.0
7    12.0
8    37.0
9    24.0
Name: age, dtype: float64

In [23]:
# apply 함수를 이용해 데이터프레임 객체의 개별원소에 적용시켜보자 

df_apply = df.applymap(add_10)
df_apply.head(10)

    age     fare  ten
0  32.0  17.2500   20
1  48.0  81.2833   20
2  36.0  17.9250   20
3  45.0  63.1000   20
4  45.0  18.0500   20
5   NaN  18.4583   20
6  64.0  61.8625   20
7  12.0  31.0750   20
8  37.0  21.1333   20
9  24.0  40.0708   20

In [2]:
# 시리즈 객체에 함수 매칭 
#  DataFrame객체.apply(매핑함수, axis = ) 함수

# 결측값을 확인하는 함수를 만들어보자 
import seaborn as sns 
titanic = sns.load_dataset("titanic")
df= titanic.loc[:,["age","deck"]]
df.head()

    age deck
0  22.0  NaN
1  38.0    C
2  26.0  NaN
3  35.0    C
4  35.0  NaN

In [9]:
def missing_value(x):
    return x.isnull()

result = df.apply(missing_value,axis = 1)
print(result.head())
print('\n')
print(type(result))

     age   deck
0  False   True
1  False  False
2  False   True
3  False  False
4  False   True


<class 'pandas.core.frame.DataFrame'>

In [18]:
# 최대값에서 최소값을 뺀 값을 반환하는 사용자함수를 정의

import seaborn as sns 

titanic = sns.load_dataset("titanic")

data = titanic.loc[:,["age","fare"]]


def diff(x):
    return x.max() - x.min()


# 데이터 프레임의 행, 열에대해 적용하기

result = data.apply(diff, axis = 0)
result1 = data.apply(diff, axis = 1)
print(data.max())
print(data.min())
print('\n')
print(data.head())
print('\n')
print(result.head())
print('\n')
print(result1.head())

age      80.0000
fare    512.3292
dtype: float64
age     0.42
fare    0.00
dtype: float64


    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500


age      79.5800
fare    512.3292
dtype: float64


0    14.7500
1    33.2833
2    18.0750
3    18.1000
4    26.9500
dtype: float64

In [20]:
# 함수적용2

def add_two(a,b):
    return a + b

data = data.apply(lambda x: add_two(x["age"],x["fare"]), axis = 1)
data.head()

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64